app/views/ice_creams/index.html.erb

SELECT `extras`.* FROM `extras` WHERE `extras`.`id` = 1 LIMIT 1
---
    <td><%= ice_cream.flavor.name rescue nil %></td>
    <td><%= Extra.where("id IN(?)",  ice_cream.extra_ids).collect(&:name).join(',') %></td>