app/views/ice_creams/show.html.erb

SELECT `extras`.* FROM `extras` WHERE `extras`.`id` = 1 LIMIT 1
---
  <b>Extras:</b>
  <%= Extra.where("id IN(?)",  @ice_cream.extra_ids).collect(&:name).join(',')  %> -------------------------------------- $<%= Extra.where("id IN(?)",  @ice_cream.extra_ids).collect(&:price).sum %>

SELECT `cone_for_cups`.* FROM `cone_for_cups` WHERE `cone_for_cups`.`id` = 1 LIMIT 1
SELECT `flavors`.* FROM `flavors` WHERE `flavors`.`id` = 2 LIMIT 1
---

<p><b>Total:</b> --------------------------------------------------------  $<%= @ice_cream.cone_for_cup.price +  Extra.where("id IN(?)",  @ice_cream.extra_ids).collect(&:price).sum + (@ice_cream.flavor.price * @ice_cream.total_number.to_i)   %></p>