app/views/site/index.html.erb

SELECT `cone_for_cups`.* FROM `cone_for_cups` LIMIT 1
---

           <% ConeForCup.all.each_with_index do |clone, index| %>

SELECT `flavors`.* FROM `flavors`
---

        <%= f.select :flavor , options_for_select(Flavor.all.collect {|s|[ s.name, s.id]} ), {:prompt => 'Choose a flavor'}, :onChange => "update()"  %>

SELECT `extras`.* FROM `extras` LIMIT 1
---

           <% Extra.all.each_with_index do |clone, index| %>