app/controllers/ice_creams_controller.rb

  def index
    @ice_creams = IceCream.all
---
SELECT `ice_creams`.* FROM `ice_creams`

  def show
    @ice_cream = IceCream.find(params[:id])
---
SELECT `ice_creams`.* FROM `ice_creams` WHERE `ice_creams`.`id` = 1 LIMIT 1

  def create

    @ice_cream = IceCream.new(params[:ice_cream])
    @extra = Extra.where("id IN(?)", params[:ice_cream][:extra_ids])
    @ice_cream.extra_ids = @extra.collect(&:id).join(',')
    @ice_cream.status = params[:ice_cream][:status]

    @ice_cream.cone_for_cup_id = params[:ice_cream][:cone_for_cup]
    @ice_cream.flavor_id = params[:ice_cream][:flavor]
    @ice_cream.user_id = current_user.id

    respond_to do |format|
      if @ice_cream.save
---
SELECT `extras`.* FROM `extras` WHERE (id IN('1'))
INSERT INTO `ice_creams` (`cone_for_cup_id`, `created_at`, `extra_ids`, `flavor_id`, `status`, `total_number`, `updated_at`, `user_id`) VALUES (NULL, '2015-04-30 16:12:21', '---\n- \'1\'\n', NULL, NULL, 1, '2015-04-30 16:12:21', NULL)

  def update_cal

     @cone_for_cup = ConeForCup.find(params[:ice_cream][:cone_for_cup])
     @flavor = Flavor.find(params[:ice_cream][:flavor])
     @number = params[:ice_cream][:total_number]
     @extra = Extra.where("id IN(?)", params[:ice_cream][:extra_ids])
---
SELECT `cone_for_cups`.* FROM `cone_for_cups` WHERE `cone_for_cups`.`id` = 2 LIMIT 1
SELECT `flavors`.* FROM `flavors` WHERE `flavors`.`id` = 1 LIMIT 1
SELECT `extras`.* FROM `extras` WHERE (id IN('1'))

  def confirm
      @ice_cream = IceCream.find(params[:id])
      @ice_cream.status = "completed"
      @ice_cream.save!
---
SELECT `ice_creams`.* FROM `ice_creams` WHERE `ice_creams`.`id` = 4 LIMIT 1
UPDATE `ice_creams` SET `status` = 'completed', `updated_at` = '2015-04-30 16:56:37' WHERE `ice_creams`.`id` = 4