app/controllers/site_controller.rb

SELECT `cone_for_cups`.* FROM `cone_for_cups` LIMIT 1
---
  def index
     @cone_for_cups = ConeForCup.all